# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:

* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='https://curriculum-content.s3.amazonaws.com/data-science/images/Database-Schema.png' width="600">

## Connect to the Database

Include the relevant imports, then connect to the database located at `data.sqlite`.

In [1]:
# Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')

## Employees and Their Offices (a One-to-One Join)

Select all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [2]:
# Your code here
df=pd.read_sql("""
       SELECT firstName, lastName, State, city
       FROM employees
       JOIN offices
          USING(officeCode)
       ORDER BY lastName;      
 """, conn)
df.head()

  firstName  lastName state           city
0    Gerard    Bondur                Paris
1      Loui    Bondur                Paris
2     Larry      Bott               London
3   Anthony       Bow    CA  San Francisco
4    Pamela  Castillo                Paris

## Customers and Their Orders (a One-to-Many Join)

Select all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [3]:
# Your code here
df=pd.read_sql("""
          SELECT ContactFirstName,ContactlastName,orderNumber,orderDate,status
          FROM customers
            JOIN orders
            USING(customerNumber)
""",conn)
df.head()

  contactFirstName contactLastName  orderNumber   orderDate   status
0          Carine          Schmitt        10123  2003-05-20  Shipped
1          Carine          Schmitt        10298  2004-09-27  Shipped
2          Carine          Schmitt        10345  2004-11-25  Shipped
3             Jean            King        10124  2003-05-21  Shipped
4             Jean            King        10278  2004-08-06  Shipped

## Customers and Their Payments (Another One-to-Many Join)

Select all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [15]:
# Your code here
query = """
    SELECT 
        c.ContactFirstName, 
        c.ContactLastName, 
        p.paymentDate, 
        p.amount
    FROM 
        customers AS c
    JOIN payments AS p
        ON c.customerNumber = p.customerNumber
    ORDER BY 
        p.amount DESC;
"""
df = pd.read_sql(query, conn)
df.head()

  contactFirstName contactLastName paymentDate     amount
0           Diego           Freyre  2005-03-18  120166.58
1           Diego           Freyre  2004-12-31  116208.40
2            Susan          Nelson  2003-08-15  111654.40
3             Eric       Natividad  2003-12-26  105743.00
4            Susan          Nelson  2005-03-05  101244.59

## Orders, Order Details, and Product Details (a Many-to-Many Join)

Select all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [16]:
# Your code here
df=pd.read_sql("""
          SELECT ContactFirstName,ContactlastName,orderNumber,orderDate,productname,quantityInStock
          FROM customers
            JOIN orders
            USING(customerNumber)
            JOIN orderdetails
            USING (orderNumber)
            JOIN products
            USING (productCode)
        ORDER BY 
""",conn)
df.head()

DatabaseError: Execution failed on sql '
          SELECT ContactFirstName,ContactlastName,orderNumber,orderDate,productname,quantityInStock
          FROM customers
            JOIN products
            USING(customerNumber)
': cannot join using column customerNumber - column not present in both tables

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!